{
    "status": "success",
    "status_code": 200,
    "message": "Message sent successfully!",
    "data": {
        "vector_data": [
            {
                "id": 28960,
                "source_url": "https:\/\/www.drmalpani.com\/hotels",
                "text": "Hotels Near Malpani Infertility Clinic http:\/\/www.oyorooms.com\/mumbai\/hotels-in-CST---South-Mumbai?location=CST+-+South+Mumbai%2C+Mumbai%2C+India&city=mumbai&citycode=MUM&longitude=72.8346536&latitude=18.9409708&pageType=locationHappy Home Hotel66, Woodehouse Road,Opp. Chiragdin Showroom,Colaba, Mumbai - 4000005A\/C RoomAttached BathroomFood service Room Charges 1400\/- Single Room2000\/- Double Room. This is a 5 min walk away from the clinic.Tel: 91-22-22186072Hotel Fortune www.hotelfortune.inHotel Manama www.hotelmanama.comHotel ApolloNear Regal CinemaWebsite: http:\/\/www.mumbainet.com\/hotels\/godwin\/Hotel GodwinNear Electric House, ColabaWebsite: http:\/\/www.mumbainet.com\/hotels\/godwin\/info@hotelcausewayindia.comWebsite: http:\/\/www.hotelcausewayindia.comHotel Fariyas, ColabaYou can find more hotels athttp:\/\/www.asiarooms.com\/india\/mumbai_(bombay).htmlandhttp:\/\/www.indiahotels.com\/hotels\/mumbai-hotels.htmlIf you bring your laptop, you can buy an internet access card locally !Click here Bring your mobile and buy an inexpensive SIM card in India. India has some of the cheapest international calling rates, so you can call home inexpensively !Bombay is India's most happening city, and the following websites will tell you all you wanted to know about Bombay...www.mumbaibest.comhttp:\/\/www.mid-day.com\/If you want to visit the Taj Mahal or go to Goa, you can do so between Day 4- Day 9 of your cycle. India is truly incredible !",
                "tokens": 403,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 27025,
                "source_url": "https:\/\/www.drmalpani.com\/hotels",
                "text": "Hotels Near Malpani Infertility Clinic We are fairly close to VT Station and Churchgate Railway Station (about 15 minutes by taxi). We are in Colaba, the heart of tourist Bombay !Your best choice would be Gopal Mansion. Their website is www.gopalmansion.com.This is a building with 50 rooms, about 30 min away from the clinic, which is run exclusively for patients and their relatives. An airconditioned room with TV and bath is only Rs 800 per night , and is run as a charitable service by the famous philanthropist, Mr R K Damani.You need to send an email in advance to book your room, as they are very busy, and the rooms are in high demand.You will need the following· Reference Letter from us· Your medical documents · Valid passport id proof (Address proof for patients living in India, such as PAN card or Aadhar card). Luxury Hotels near the clinic.Hotel Taj Mahal, Colaba. 15 minute walk awayWebsite: www.tajhotels.comHotel President, Cuffe Parade. 5 minute walk away. This 5 star hotel is the closest to our clinic.Website: www.tajhotels.comPlease let them know that you were referred by Malpani Infertility Clinic. They will also be happy to arrange for a car to take you from the airport directly to the hotel.Shop around for the best deal. Since you will be staying for at least a week, most hotels will be happy to negotiate a reduced rate for you. You should expect to pay about 80% of the \"rack rate\".You can select a flat\/apartment through Airbnb ( www.airbnb.com) as well. The rentals near Colaba are at https:\/\/goo.gl\/TTFH1tThere is a 2-star hotel right opposite our clinic.Hotel Everest,26-A ,Colaba Chamber, 4th Floor, Sb Singh Road,Near Sahkari Bhandar,Colaba, Mumbai 400005.L+91 22 22152784\/9820553242 .hoteleverestonline@yahoo.comhttp:\/\/www.galaxygroupofhotels.com\/Hotel Supreme, http:\/\/www.hotelsupreme.inThis is a 5 min walk from our clinic . They offer a special package for our patients. This 10 nights package is Rs.30000.00( Thirty thousand only) for a single occupancy and Rs.34000.00 (Thirty four thousand only) for double occupancy. This includes Room rent on twin sharing basis, all the taxes, breakfast and Airport transfers.You can find other hotels close to the clinic at:",
                "tokens": 542,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 38508,
                "source_url": "https:\/\/www.drmalpani.com\/travel",
                "text": "Coming to Malpani Infertility Clinic for IVF treatment In September the intensity of rainfall decreases. The monsoons officially end in the 3rd week of September. September has unsettled weather. The rainfall is short and light and is not continuous. The end of the monsoon, much like the beginning can feature heavy thunderstorms associated with the withdrawal of the monsoon current from the city and surrounding areas. The mean maximum daily temperatures reach 30.1°C while daily mean minimum daily temperature stays at 24.0°C. Cotton clothes are comfortable throughout the year.Places to visitMumbai offers a plethora of delights for the visitor. Of course, no visit to Mumbai is complete without catching a sight of the famous Gateway of India monument. There are many other interesting sights in downtown Mumbai such as the Prince of Wales Museum and the Hanging Gardens and the Rajabhai Clock Tower.The most spectacular sight near Mumbai are the magnificent caves, dedicated to the Hindu Lord Shiva on Elephanta Island, a short boat ride from the downtown jetty. These caves are a must-see and have been declared a World Heritage Site by the UNESCO. A two-day trip from Mumbai to the famous Ajanta and Ellora Caves near Aurangabad are equally beautiful, which are also a World Heritage Site worth seeing. For a relaxing break, a trip to the former Portuguese colony of Goa with its pristine beaches and seafood bonanza is recommended.CuisineMumbai offers a wide gastronomic choice with more than a thousand cafés and restaurants across the city. Spicy cuisine from various corners of India, fusion cuisine and international cuisine such as Continental, Thai, Japanese, Mexican & Chinese await the discerning palate.Mumbai by nightMumbai is the quintessential city that never sleeps. Trendy pubs and nightclubs are located in the downtown area as well as the suburbs. Many restaurants double up as bars and nightclubs and stay open till late hours. The dazzle of Bollywood movies beckons and even late night movies play to a full house. So don't be surprised if you are caught in a traffic jam at midnight even on a week day.ConnectivityMumbai is well connected by air with the rest of India as well as the world. It has the busiest network of domestic flights, with services to more than 30 cities daily, including flights to Aurangabad near the Ajanta and Ellora Caves and Agra, Jaipur and Kerala. The international airport, Chhatrapati Shivaji International Airport, (www.mumbaiairport.com) located at Sahar, is about 4 km (2.5 miles) away from the domestic airport, Chhatrapati Shivaji Domestic Airport located at Santa Cruz.",
                "tokens": 551,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 29018,
                "source_url": "https:\/\/www.drmalpani.com\/resource\/book\/chapter30",
                "text": "Costs vary widely, and you should enquire how much it will be..",
                "tokens": 17,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 35622,
                "source_url": "https:\/\/www.drmalpani.com\/travel",
                "text": "Coming to Malpani Infertility Clinic for IVF treatment You can calculate exchange rates from your currency into Indian rupees at http:\/\/www.xe.com\/.Here are some more tips for travellers to India !Over the last 13 years, we have treated patients from all over the world- USA, UK, Australia, Middle East , Kenya, Nigeria and Singapore. Our patients have been surprised and pleased at the convenience that our system offers them . In fact, many feel that it is easier to be treated at Malpani Infertility Clinic, than to take treatment in their own home city . In addition, taking off 10 to 14 days in a relaxed setting, where you can bond with your partner and with us can only help promote an optimal outcome. You can also fly down to see the Taj Mahal, or get an ayurvedic massage in Kerala to melt your stress away.A complete IVF cycle at our clinic costs only US $ 4000 - and this is all-inclusive of all medical procedures, including lab tests, scans, egg pickup and embryo transfer. We do not charge extra for ICSI which means a complete cycle of IVF with ICSI also costs only US $ 4000. The approximate total costs of all the medicines used for superovulation for one complete cycle is about US $ 1000 more. Embryo freezing (including storage for 1 year) is US $ 1000. Laser assisted hatching and blastocyst transfer cost US $ 500 more. A complete cycle of PGD costs US $ 6000. A complete cycle of donor egg IVF costs US $ 7500 only (including payment for the egg donor). Embryo adoption costs US $ 5000 only.We provide a package deal which includes ALL costs, rather than add on costs for individual services (such as scans, OT charges, lab fees and so on) which many other clinics do ! This helps patients to know what their TOTAL cost will be upfront. We have no hidden expenses.As an added service to our patients, we now accept payment at the clinic using international credit cards (Visa, MasterCard or American Express).CurrencyIndian Rupees (INR) is the currency of India, the approximate conversion rate is 1USD = Rs. 46.Currency notes are available in multiples of 10, 20, 50, 100, 500 & 1000.About MumbaiBombay, which has recently been rechristened to its ancient ethnic name of Mumbai, is the largest metropolis in India. This city, home to roughly 15 million people is located on the west coast of India and is the capital of the state of Maharashtra. Truly the 'Gateway of India', it is an important hub for international flights to India and the biggest port in India. Mumbai contributes the most to foreign trade in the country and it is the nation's commercial capital. The city is located on an island with a deep natural harbour.Climate",
                "tokens": 604,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 37548,
                "source_url": "https:\/\/www.drmalpani.com\/travel",
                "text": "Coming to Malpani Infertility Clinic for IVF treatment A return air ticket to India from the US costs about US $ 1000- 1500. Your husband can accompany you, or you can hand-carry his frozen sperm in a dry shipper (which you will need to borrow from your local infertility clinic) or in a dry-ice box packed with dry ice. The clinic is in the heart of south Bombay, and is an hour's ride away from the airport. IVF treatment is done on a day-care basis, so you do not need hospitalisation at all. There are many hotels nearby and we can help you arrange accommodation in close proximity to our clinic. You can check them here -  https:\/\/www.drmalpani.com\/about-us\/hotels-near-the-clinic . You only need to make 4 - 6 visits to the clinic during the entire cycle, and after the embryo transfer, you can fly back home.When you buy tickets to come for IVF, please make sure these are flexible tickets. Eggs can grow at variable rates - and it's useful to have some flexibility in your travel plans, to allow for this biological variability !Over half our patients come to us from out of Bombay; and a quarter of all our patients come from overseas, so we are very experienced in meeting your special needs. To make the process as easy as possible for you, we have developed protocols that allow you to interact easily with us by email. You can have all your preliminary testing and care performed by your own doctor in your own town. This means that with well-planned scheduling, you only need to spend about 10 to 20 days at our clinic to complete an IVF cycle of treatment.Traveling to do IVF may make it less stressful for you. Getting prepared for the cycle is more stressful (things to do to get ready for the trip, etc.), but the cycle itself may be less stressful. You can do a lot of sightseeing and you may obsess less about the cycle that way than you would have if you were home and working. Also, you have fewer responsibilities to worry about and can concentrate on your cycle.If you send me your complete name and address, I will email you an invitation letter, so you can apply for a Medical (M-visa) from the Indian embassy. You can find out where the Indian embassy in your clinic is at www.embassyworld.com.",
                "tokens": 608,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 27261,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/ivf\/ivf-cost-in-mumbai-test-tube-baby-cost-in-mumbai",
                "text": "IVF cost in Mumbai | Test tube baby cost in Mumbai With improved medical technology, impeccable credentials of fertility specialists, and medical staff, and the use of the latest technologies for the purpose of IVF treatments, it is no wonder that people from all over the world come to India for IVF. The treatment cycle itself takes about 2 to 4 weeks to complete, after which the woman must take a pregnancy test to see if the fertilized embryo has implanted or not.The success rates of IVF are very high in India, with some clinics boasting success rates as high as 65%, among women in the 21 to 30 age group. The younger the woman, the higher the chances of a successful IVF pregnancy. As the woman ages, there is a proportionate drop in success rates. However, the success rates offered by IVF in each cycle are higher compared to those of other treatments such as IUI.In many cases, the cumulative success rate of three or more cycles may be upwards of 70%. It means, that women have the most chances of getting pregnant through IVF fertility treatments, and this often justifies the test tube baby cost. The more cycles the woman chooses to undergo, the better the chances of success.Summary: Test tube baby costs in India are comparatively less than what they are in most other countries and people from all over the world come here for their treatment.Not happy with your IVF clinic? Need more information? Here is our contact details: Our Whatsapp clinic mobile +91 9867441589 Email your query at info@drmalpani.com Clinic Address - Malpani Infertility Clinic, 505, Jamuna Sagar, Near Coloba bus Depot, Shahid Bhagat Singh Road, Coloba, Mumbai 400 005Malpani Infertility Clinic Location: https:\/\/goo.gl\/maps\/q13uhWL7iNUHM8hK6 Our clinic is much better than others, because of our superior expertise and depth of experience. Our success rates are high and we keep our patients' stress levels low. We believe the best patient is a well-informed one, and that you are the most important person in our clinic.",
                "tokens": 470,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 28865,
                "source_url": "https:\/\/www.drmalpani.com\/success-stories\/ivf-success-stories-ray-of-hope-for-usa-couple",
                "text": "So it becomes very easy to travel to Mumbai if you are not from that place..",
                "tokens": 18,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 36699,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/most-successful-ivf-centre-in-mumbai-india",
                "text": "Most successful IVF centre in Mumbai, India Mumbai is the medical capital of India, and Mumbai IVF clinics attract patients from all over the world, because we offer state-of-the-art medical technology at affordable prices. Good IVF clinics routinely use the newest IVF techniques, such as blastocyst ( Day 5) transfers and vitrification to freeze and store supernumerary embryos. More importantly, they are open and transparent. They respect the patient, and offer a detailed treatment plan, so patients know exactly what to expect. They provide photos of embryos routinely to all their patients, so that patients are reassured knowing they have receive high quality medical treatment. Patients are able to get treatment that is at par with the rest of the world, but at less than half of the cost in western countries. There are many high quality IVF clinics in Mumbai, and selecting the best clinic will allow you to maximise your chances of IVF success.",
                "tokens": 192,
                "created_at": "2024-10-07T00:00:00.000Z",
            },
            {
                "id": 36616,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/test-tube-baby-treatment-cost-in-mumbai",
                "text": "How much does a test tube baby treatment cost in Mumbai? Before starting an IVF treatment cycle, one of the first questions the patient needs to know is how much it is all going to cost. They know that the success rate is not 100% and that they may have to repeat many cycles before getting pregnant. IVF is expensive, and it's a big drain on the budget. Because it's not covered by insurance and they need to pay out of pocket, this is something which they need to be very careful about. Now many IVF clinics take out a lot of ads, and in order to lure patients, they advertise at a very low rate. However, they do not explain to the patient that this is just their initial sign-up rate and that as the cycle progresses, the patients will have to keep on paying more and more. These clinics keep on extracting Â additional amounts during the treatment, as a result of which the total cost for the patient for that cycle balloons up so much that the poor patient ends up spending twice as much as he had budgeted for! This creates even more friction between the husband and the wife, as the husband finds he just does not have enough money to spend on fulfilling his wife's dream of having a baby. This is why it's important to get an upfront cost - preferably a packaged, all-inclusive cost so that there are no unpleasant surprises later on. This is the best way of ensuring that you don't get taken for a ride.Â For any personal care or IVF treatment, you can directly visit our IVF Clinic in Mumbai.",
                "tokens": 359,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 31295,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/what-you-need-to-know-about-ivf",
                "text": "In Vitro Fertilization As a result of our simplified protocol, out of town patients can start their superovulation in their own city, and need to stay in Bombay for only 8-10 days. There are a number of hotels nearby which offer comfortable boarding and lodging as well. You can check them by clicking on this link - https:\/\/www.drmalpani.com\/about-us\/hotels-near-the-clinic . There are a number of hotels nearby which offer comfortable boarding and lodging as well.You can book your tickets online, and find the best deals by asking Indian travel agents in your city. A return air ticket to India from the US costs about US $ 1000-1500. Your husband can accompany you, or you can hand-carry his frozen sperm in a dry shipper (which you will need to borrow from your local infertility clinic).If you have failed IVF in the past, we can use advanced technology to maximise your chances of getting pregnant.",
                "tokens": 182,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 37586,
                "source_type": 3,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/maximizing-your-ivf-success-why-patients-choose-malpani-infertility-clinic",
                "text": "Maximizing Your IVF Success: Why Patients Choose Malpani Infertility Clinic? Many patients want to travel to Mumbai to do an IVF cycle in our clinic because they know that they will get the best possible medical care. They appreciate the fact that we provide high technology with a high touch, and this combination allows them to maximize their chance of getting pregnant. This blend of competence with compassion is rare, which is why many patients who have failed an IVF cycle and are finally able to differentiate between a good clinic and a bad clinic, seek us out. We create a lot of educational materials to educate IVF patients, and we share this for free online, Patients appreciate our openness and transparency because this helps them to have realistic expectations of IVF treatment.Many patients have failed an IVF cycle, and are not happy with the local options which are available to them, because most clinics hide information from their patients. They refuse to provide photographs of embryos to their patients and make up all kinds of flimsy excuses to explain the IVF failure. Patients get irritated with this opacity, and while they are keen to come to Mumbai for their treatment, they are worried about the logistics of organizing this. Not only have they heard that Mumbai is an expensive city, it's also hard for them to take so much time off from work. Most patients still think that an IVF treatment takes about 20 days, but in our clinic, we have streamlined our treatment protocol so efficiently, that you only need to spend about 7 – 10 days in Mumbai. Also, because of our tie-up with Gopal Mansion (www.gopalmansion.com), the cost of staying is only Rs 800 per night for a couple in an AC room!Your treatment can be started locally in your hometown, so the amount of time you spend in Mumbai gets slashed dramatically, without compromising the quality of your care. Most of our patients are well-informed and are comfortable using email to share medical information with us.I review their medical records, and then send them the treatment plan well in advance, so they can organize their tickets, stay and leave. The husband needs to come for only one day, which makes this even more feasible and convenient.",
                "tokens": 449,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 35674,
                "source_url": "https:\/\/www.drmalpani.com\/",
                "text": "What is address of Dr Malpani clinic?\nAddress: Malpani Infertility Clinic. 505, Jamuna Sagar, near Colaba Bus Depot, Shahid Bhagat Singh Road, Colaba, Mumbai 400 005",
                "tokens": 49,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 28893,
                "source_url": "https:\/\/beyondchatsnew.s3.ap-south-1.amazonaws.com\/training_data\/Tries, Sighs, and Lullabies  pages 1-240 (26 January 2023 absolute final)_090224_162039.pdf",
                "text": "another three days on the train to reach Mumbai.  When we reached the station, I realised that I had lost the address and phone number of your clinic.  I had absolutely no clue what to do and had lost all hope.  It was my sheer luck that I met a taxi driver outside the station.  I happened to ask him if he knew how to reach the Malpani clinic.  He nodded and told us that he knew where it is as he had taken many people from the station to the clinic.  He then told us which bus would get us here.  It was a sign from God, ’ he said with a",
                "tokens": 131,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 28824,
                "source_url": "https:\/\/beyondchatsnew.s3.ap-south-1.amazonaws.com\/training_data\/Tries, Sighs, and Lullabies  pages 1-240 (26 January 2023 absolute final)_090224_162039.pdf",
                "text": "it would rupture.  We would then have to do the intrauterine insemination on the very same day.  ‘But madam .  .  .  ’ Magan began, ‘we are not well off and cannot afford the stay and your full charges.  ’ ‘Don’t worry, ’ I said.  ‘I’ll reduce them for you.  ’ Magan folded his hands in gratitude.  ‘Do you have a place to stay around here? ’ I asked.  ‘We will sleep at the station, ’ Magan replied, after a thoughtful pause.  Seeing their plight, I offered them one of the empty rooms in the clinic.  ‘We can’t thank you enough, madam, ’ Magan mumbled, his eyes welling up.",
                "tokens": 161,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 27080,
                "source_type": 3,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/a-free-simple-fun-effective-way-to-improve-your-fertility",
                "text": "This means that the poor couple ends up converting a pleasurable bedroom activity into a clinical activity - and to add insult to injury, they have to pay for this !.",
                "tokens": 35,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 37373,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/ivf-cost-in-mumbai",
                "text": "IVF cost in Mumbai with break-up of all costs ( clinical fees, blood tests, medication costs etc) | Malpani Infertility Clinic, Mumbai Make sure you do your research properly before selecting an IVF clinic. Understand the process and make sure you are financially ready for this. Most fertility treatments tend to be expensive which is why you need to be sure that you plan everything from the start. Knowing the right IVF treatment cost is very necessary to ensure that you don’t pay more than necessary. 2-Rate of SuccessIVF cost in India is comparatively low than in other countries such as the U.K. or the U.S., but it is high for the general population. This is why you need to know your chances of success with IVF. Which clinic you select makes a world of a difference, so don't blindly go to the one which is nearest or the one which is cheapest - this may turn out to be a more expensive option in the long run! 3-AgeAge is an important factor with regards to IVF success rates. It's not just your calendar age which we are concerned with - it's the age of your ovaries, as judged by your ovarian reserve. We can test this by checking your AMH level and your antral follicle count.Even for women above the age of 35, reputed IVF clinics like Malpani Infertility Clinic have high success rates for IVF because we can modify your superovulation protocol to help you grow better quality eggs, thus maximizing your chances of getting pregnant. SummaryIVF has given hope to many couples who have tried for years to get pregnant. However, the success rate depends on the quality of the care provided by the clinic, and this does influence the cost of your treatment.",
                "tokens": 398,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 25885,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/is-coming-to-mumbai-safe-for-ivf-patients",
                "text": "Is coming to Mumbai safe for IVF patients? Lots of out-of-Mumbai patients are reluctant to travel to Mumbai to our clinic for their IVF treatment, even though they know our IVF pregnancy rates are the best in the country. This is because they've been told all kinds of horror stories about IVF treatment. They have been misinformed that they need to visit the clinic everyday; that they need daily ultrasound scans; that they require injections on a daily basis which need to be given at the clinic; they need bed rest after the transfer; and that travel after the embryo transfer is unsafe. They are also warned that IVF pregnancies need special care, and this can only be provided locally, which is why they are scared to come to Mumbai. However, none of this is true at all. These are just myths which are propagated by local IVF clinics in their town, in order to hold onto their patients, and make sure that they don't travel outside the city. This is a shame, because pregnancy rates in these local clinics aren't good, but they don't want to lose their patients. The fact of the matter is that IVF logistics is very simple. We provide a well-defined clear treatment plan which is easy to follow. No hospitalization is required, and patients only need to come to clinic about 4-5 times over a 15 day period. You can download the IVF comic book free at https:\/\/www.drmalpani.com\/pdf\/IVF_COMIC_BOOK.pdf",
                "tokens": 340,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 25246,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/why-ivf-isn-t-guaranteed-to-work-every-time",
                "text": "Clinic vs bedroom - the dilemma before infertile couples IVF is much more costly - but it's also much more efficient ! And while it's true that treatment is expensive, a baby is priceless ! The important thing is to continue to have realistic expectations, so that no matter what the outcome , you have control over the process, and thus achieve peace of mind you did your best ! What more can a human being ask for ?",
                "tokens": 88,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 25292,
                "source_url": "https:\/\/www.thebestmedicalcare.com\/how-to-get-the-best-medical-care\/informed-consent-a-crucial-factor.html",

                "tokens": 251,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 35639,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/why-is-malpani-clinic-featured-in-the-media-toi3",
                "text": "Soon, Stethoscopes, Not Sight-seeing, Could Bring Tourists To City Times of India, By Shabnam Minwalla A few months ago, Dr Niteen Dehia of Laser Eye Vision received an unusual request. A busload of Britishers, who were planning a trip to Goa, wanted to stop over in Mumbai to correct their vision through Lasik surgery. The doctor was happy to oblige, and is now preparing for the 15 bespectacled tourists who will be arriving in December. When Dr. Aniruddha Malpani decided to invest Rs 25 lakhs in equipment for Preimplantation Genetic Diagnosis - a technique used to rule out genetic disorders in the embryo- he knew that only the rich and desperate in India would come forward. But he suspected that international patients might be interested. The hunch paid off. Half the inquiries that Dr Malpani has fielded in this connection have come from abroad. And in January, he will be undertaking the highly specialised procedure for an American couple. Recently, a surprised Dr. Kanir Bhatia found himself scheduling appointments around flight timings and tourist itineraries. An American who was coming to India to see the Taj, had decided to undergo a complicated dental procedure as well. If these cases are any indication, more and more visitors are arriving in India for reasons which have as much to do with stethoscopes as sight-seeing. For, given the fact that top-of-the-line medical treatment is available in Mumbai for a fraction of the Manchester or Muscat rate, international patients have actually begun to contemplate facelift-cum-Fatehpur Sikri trips to India. Even if you include the price of the ticket and some sight-seeing, dental work like teeth implants and smile design work out cheaper here, says Dr Bhatia, a cosmetic dentist and implantologist. Concurs Dr Vijay Sharma, a cosmetic surgeon with a steady international clientele, The entire country is focused on the IT revolution. But if we play our cards right, healthcare could well be the next boom. To say that 'medical tourism' is already a trend may be overstating maters somewhat. But there is an undeniable trickle of international patients, especially in areas like cosmetic surgery, cosmetic dentistry, infertility treatment and eye surgery. These branches are often denied insurance in countries like the U.S. and Canada, or are considered extremely low priority by national healthcare systems in countries like the UK. Related News: 'Skilled manpower, low cost of treatment attract foreigners' Top",
                "tokens": 520,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 33763,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/the-best-ivf-center-in-mumbai",
                "text": "The best IVF center in Mumbai Overview : IVF centers are crucial for successful IVF treatment, as it is an expensive procedure. Malpani Infertility Clinic in Mumbai is a top choice for patients worldwide due to its state-of-the-art equipment and expertise in the IVF laboratory. As a boutique IVF clinic in Mumbai, they provide personalized care and high-tech equipment, ensuring safe embryo growth and quality blastocyst formation Every patient wants to go to the best IVF center - after all, IVF is an expensive treatment, so you want to choose the IVF center with the highest success rate, to maximize your chances of getting pregnant quickly. Not all IVF centers are created equal, and there is a huge difference in the success rates of the best and the others. This is because the IVF laboratory is the heart and soul of an IVF clinic, but most IVF patients have no idea about how good or bad the laboratory facilities in the IVF clinic are. Not only do the best IVF centers have state-of-the-art equipment, but they also have a lot of experience and expertise, so they can grow and culture your embryos safely, so they form top-quality blastocysts in the lab before they are transferred into your uterus. This is why patients from all over the world choose Malpani Infertility Clinic for their IVF treatment in Mumbai. We combine high tech with high touch because we are a boutique IVF clinic that provides highly personalized care to all our patients! Need help in getting pregnant? You can schedule a paid consultation via video call by clicking [here](https:\/\/pages.razorpay.com\/ivf-online-consultation), or if you require personal care and IVF treatment in Mumbai, you can whatsapp us to book an appointment and come to our Clinic in Colaba, Mumbai.",
                "tokens": 398,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 26978,
                "source_url": "https:\/\/beyondchatsnew.s3.ap-south-1.amazonaws.com\/training_data\/Tries, Sighs, and Lullabies  pages 1-240 (26 January 2023 absolute final)_090224_162039.pdf",
                "text": "through.  ‘We have already seen another small apartment in an upcoming building in the suburbs, ’ she continued.  ‘We need to pay them fifteen thousand rupees to book the house.  The last day of payment is in two days.  Please help me.  Only you can help me, madam.  ’ Shivani’s plea instantly tugged at my heartstrings and filled me with compassion.  I realised that life had put me in a position to uplift this poor, little girl from her suffering and help her to lead a normal family life which many of us take for granted!  I also wondered how many such young,",
                "tokens": 131,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 38572,
                "source_url": null,
                "text": "Book a second opinion\n\nFor a Personalized, Convenient and Flexible second-opinion you can book a 30min consultation call with Dr. Malpani, which costs you 3000 rupees.",
                "tokens": 41,
                "created_at": "2024-10-07T00:00:00.000Z",
            },
            {
                "id": 27318,
                "source_url": "https:\/\/beyondchatsnew.s3.ap-south-1.amazonaws.com\/training_data\/Tries, Sighs, and Lullabies  pages 1-240 (26 January 2023 absolute final)_090224_162039.pdf",
                "text": "81Chapter 5 Born to Be G anesh  Chaturthi  (an auspicious Hindu festival) has always been celebrated with great enthusiasm at my parents’ house.  Family and  friends would gather at our house to pay respect and pray to Lord Ganesha.  It is believed that devotees who pray to Lord Ganesha are able to fulfil their wishes and desires.  I still remember that every Ganesh Chaturthi, a throng of guests, some known and some unknown, would visit our house to celebrate the festival.  This would include couples who were trying hard to conceive as well as couples",
                "tokens": 129,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 36724,
                "source_url": null,
                "text": "What is the Cost for IVF?\nA complete IVF cycle at our clinic costs about Rs 3,00,000 - and this is all-inclusive for all medical procedures. Medicines would cost about Rs  145000 more.\n\n Included services in our IVF cost:\n\n    Ovarian stimulation monitoring\n\n    Anesthesia for egg retrieval\n\n    Egg retrieval procedure\n\n    Fertilization and culture of the eggs\n\n   All physician, IVF lab, and facility fees associated with in vitro fertilization\n\nThere is NO extra cost for doing ICSI or a blastocyst transfer !\n\nExcluded services - not included in our IVF costs:\n\n    Pre-IVF screening tests \n\n   Blood tests ( such as E2 levels)\n\n    Embryo or sperm freezing or storage - these are optional services\n\nThe cost for freezing and storing embryos is Rs 70000 per year\n\nThe cost for thawing and transferring them is Rs 70000\n\nWe do NOT charge for followup consultations; or for reviewing test results.\n\nThe total cost to have a baby ( your final goal !)  will depend upon the number of cycles required to achieve success.",
                "tokens": 234,
                "created_at": "2024-09-11T00:00:00.000Z",
            },
            {
                "id": 33384,
                "source_url": "https:\/\/www.drmalpani.com\/travel",
                "text": "There's more information on hotels near the clinic at Click here !.",
                "tokens": 15,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 37074,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/price-vs-value-for-ivf-patients",
                "text": "Price vs Value for IVF patients Most IVF patients want the cheapest possible IVF treatment. They naively assume that all IVF doctors are equally good, and that success rates are high in all IVF clinics. They are basically looking for a bargain, which is why they go doctor-shopping , and hunt for the cheapest IVF clinic. Doctors are smart, and manyIVF clinics take advantage of this bargain hunting mentality of ignorant patients, who cant look beyond the price. They buy full page ads, and sponsored slots on TV talk shows. Their focus is on highlighting how affordable and cheap they are. They also offer all kinds of bargains and discounts to pure patient in, because they know that once the patient has started a treatment cycle, they cannot back out and are trapped. Please remember that someone needs to pay for these expensive ads and you are the sucker ! These ads are very misleading , because they lure patients in by quoting a low sticker price , and then add all kinds of add-ons once the treatment has started. Smart patients dont focus on only the price, but try to assess the value the clinic offers. This depends on the success rate of the clinic and how well they will take care of you, so please don't get fooled ! What to find an IVF clinic which respects your time and intelligence ? WhatsApp us at https:\/\/wa.me\/919867441589\/",
                "tokens": 280,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 33494,
                "source_url": null,
                "text": "What are the different price plans available?\nAt Dr. Malpani's clinic, there is a consultation call with Dr. Malpani available for Rs. 3000\/- for a 30-minute zoom appointment. You can also opt for an online consultation by paying on the website: [Website URL](https:\/\/rzp.io\/l\/ivf-online-consultation)",
                "tokens": 76,
                "created_at": "2024-07-11T00:00:00.000Z",
            },
            {
                "id": 31256,
                "source_url": null,
                "text": "How can I book a Zoom consultation with Dr Malpani\nA Zoom consultation lasts for 30 min and costs Rs 3000.\nYou can book this online. Read more at https:\/\/www.drmalpani.com\/amp\/contact-us",
                "tokens": 50,
                "created_at": "2024-10-13T00:00:00.000Z",
            },
            {
                "id": 35695,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/ivf-patients-and-doctor-shopping",
                "text": "IVF patients and doctor shopping Many IVF patients doctor-shop, but you need to understand the difference between cost , price and value so you can do this intelligently. IVF patients are often very confused about the costs of an IVF cycle. Obviously , they want to save money , and they read all these full page ads, which talk about how an IVF cycle costs only Rs 25000 ! They are happy to sign up , because that's an amount they can afford. However, they actually start the treatment, they end up spending more like Rs 200000, because the doctors keep on upselling them ! Sadly, IVF clinics aren't usually honest or transparent about the charges. They advertise a particular cost, but the final price which the patient ends up paying is a lot more , because there are all kinds of add- ons. This is why patients often get sticker-shock when they need to pay the bill . The take-home baby price is far more than they had budgeted for ! IVF clinics know that after the patient has started the cycle, they are stuck and cannot back out. Doctors keep upselling and adding lots of new procedures. They convince the patient to buy this by claiming that these will improve their chances of success. This means patients end up forking out much more than they expected ! To add insult to injury, they don't get value for what they're spending ! These clinics dont bother to even provide photos of the embryos to their patients, which is why the pregnancy rates in these clinics is exceptionally low. This means the cost of a baby is much higher for the poor patient, who ends up paying through her nose a little at a time ! What to find an IVF clinic which respects your time and intelligence ? WhatsApp us at https:\/\/wa.me\/919867441589\/",
                "tokens": 369,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 27254,
                "source_type": 3,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/why-does-the-cost-of-test-tube-baby-treatment-in-india-vary-so-much",
                "text": "Why does the cost of test tube baby treatment in India vary so much? Patients are often confused as to why the cost of a test tube treatment is so different from one Indian IVF clinic as compared to another. They understand that itâ\u0080\u0099s going to be more expensive in large cities like Mumbai, but there is still so much variation from clinic to clinic, that patients arenâ\u0080\u0099t sure what the right cost should be. Is it that the really expensive ones are better? Or is it that the expensive ones are greedy, and want to make more money because they want to make a larger profit? And are the cheaper ones low-cost because they cut corners, and have lower pregnancy rates? The problem is that there isn't always a direct correlation between cost and success rates. Â This problem is compounded by the fact that there is a complete Â lack of transparency, and clinics aren't open about what their success rates are. Itâ\u0080\u0099s quite easy for the large corporate chains to lure them by offering a low cost, but they keeping on padding it by adding additional costs as the cycle goes by, which means patients eventually end up paying much more - and end up still not getting pregnant!",
                "tokens": 278,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 27217,
                "source_url": "https:\/\/www.drmalpani.com\/knowledge-center\/articles\/why-is-test-tube-baby-treatment-so-expensive",
                "text": "Why is test tube baby treatment so expensive? Many infertile patients get major heartburn when they realize that they aren't able to afford test tube baby treatments because they are so expensive. They can't understand why IVF doctors charge so much, and lots of patients end up thinking of IVF clinics as being greedy. Patients need to understand that part of test tube baby treatment is clinical â\u0080\u0093 and this is what the patient sees. This includes: consultations, blood tests, ultrasound scans, egg collection, and embryo transfer. However, the heart of the IVF treatment is the IVF laboratory, and the patient doesnâ\u0080\u0099t get to see what goes on behind the scenes in the IVF laboratory. This is extremely expensive, because the consumables ( test tubes and petri dishes), and the culture medium are all imported ( which makes them expensive); and disposable, which means we canâ\u0080\u0099t reuse them. One way of reducing these costs is to get government hospitals to offer IVF treatment, because it's hard for private doctors to be able to do it inexpensively.",
                "tokens": 258,
                "created_at": "2024-02-09T00:00:00.000Z",
            },
            {
                "id": 35873,
                "source_url": null,
                "text": "Do you have a clinic in gurgaon\nI'm sorry, we do not have clinic in Gurgaon.  Our clinic named Malpani Infertility Clinic is situated in Mumbai, India at Jamuna Sagar, SBS Road, Colaba .  The address is Mumbai 400 005, India .  Our contact number is 9867441589 , and patients can also reach us via WhatsApp at https:\/\/wa.me\/919867441589\/ [[1]](https:\/\/www.drmalpani.com\/knowledge-center\/articles\/what-should-we-change-in-the-next-ivf-cycle).",
                "tokens": 126,
                "created_at": "2024-07-10T00:00:00.000Z",
            },
            {
                "id": 35677,
                "source_url": null,
                "text": "How much is fees for doctor At Dr. Malpani's clinic, there is a consultation call with Dr. Malpani available for Rs. 3000\/- for a 30-minute zoom appointment.",
                "tokens": 42,
                "created_at": "2024-07-11T00:00:00.000Z",
            }
        ],
        "sources": {
            "message_id": 361938,
            "vector_ids": [
                28960,
                27025,
                38508,
                29018,
                35622,
                37548,
                27261,
                28865,
                36699,
                36616,
                31295,
                37586,
                35674,
                28893,
                28824,
                27080,
                37373,
                25885,
                25246,
                25292,
                35639,
                33763,
                26978,
                38572,
                27318,
                36724,
                33384,
                37074,
                33494,
                31256,
                35695,
                27254,
                27217,
                35873,
                35677
            ],
            "vectors_info": [
                {
                    "score": 0.5244379923082604,
                    "vector_id": 28960,
                    "tokens_count": 403
                },
                {
                    "score": 0.5116742114729494,
                    "vector_id": 27025,
                    "tokens_count": 542
                },
                {
                    "score": 0.43299538695867523,
                    "vector_id": 38508,
                    "tokens_count": 551
                },
                {
                    "score": 0.40049120783806136,
                    "vector_id": 29018,
                    "tokens_count": 17
                },
                {
                    "score": 0.3724886628998947,
                    "vector_id": 35622,
                    "tokens_count": 604
                },
                {
                    "score": 0.3529784679412842,
                    "vector_id": 37548,
                    "tokens_count": 608
                },
                {
                    "score": 0.3497806310392203,
                    "vector_id": 27261,
                    "tokens_count": 470
                },
                {
                    "score": 0.34947068684944005,
                    "vector_id": 28865,
                    "tokens_count": 18
                },
                {
                    "score": 0.34379003569961264,
                    "vector_id": 36699,
                    "tokens_count": 192
                },
                {
                    "score": 0.3400181138526275,
                    "vector_id": 36616,
                    "tokens_count": 359
                },
                {
                    "score": 0.3368114734905211,
                    "vector_id": 31295,
                    "tokens_count": 182
                },
                {
                    "score": 0.3323253789335965,
                    "vector_id": 37586,
                    "tokens_count": 449
                },
                {
                    "score": 0.33198851346969604,
                    "vector_id": 35674,
                    "tokens_count": 49
                },
                {
                    "score": 0.3291011248947554,
                    "vector_id": 28893,
                    "tokens_count": 131
                },
                {
                    "score": 0.3282806277275109,
                    "vector_id": 28824,
                    "tokens_count": 161
                },
                {
                    "score": 0.3274518544183841,
                    "vector_id": 27080,
                    "tokens_count": 35
                },
                {
                    "score": 0.32285561289124565,
                    "vector_id": 37373,
                    "tokens_count": 398
                },
                {
                    "score": 0.31842165103087794,
                    "vector_id": 25885,
                    "tokens_count": 340
                },
                {
                    "score": 0.3021309735931126,
                    "vector_id": 25246,
                    "tokens_count": 88
                },
                {
                    "score": 0.3012710213661216,
                    "vector_id": 25292,
                    "tokens_count": 251
                },
                {
                    "score": 0.29697906970977783,
                    "vector_id": 35639,
                    "tokens_count": 520
                },
                {
                    "score": 0.2962092404116127,
                    "vector_id": 33763,
                    "tokens_count": 398
                },
                {
                    "score": 0.29613816188119124,
                    "vector_id": 26978,
                    "tokens_count": 131
                },
                {
                    "score": 0.29313210885929464,
                    "vector_id": 38572,
                    "tokens_count": 41
                },
                {
                    "score": 0.2838657329162524,
                    "vector_id": 27318,
                    "tokens_count": 129
                },
                {
                    "score": 0.27962456820157633,
                    "vector_id": 36724,
                    "tokens_count": 234
                },
                {
                    "score": 0.278657290775453,
                    "vector_id": 33384,
                    "tokens_count": 15
                },
                {
                    "score": 0.27687409840513455,
                    "vector_id": 37074,
                    "tokens_count": 280
                },
                {
                    "score": 0.2749030858393825,
                    "vector_id": 33494,
                    "tokens_count": 76
                },
                {
                    "score": 0.2746488317637944,
                    "vector_id": 31256,
                    "tokens_count": 50
                },
                {
                    "score": 0.271028431776575,
                    "vector_id": 35695,
                    "tokens_count": 369
                },
                {
                    "score": 0.26977258920669756,
                    "vector_id": 27254,
                    "tokens_count": 278
                },
                {
                    "score": 0.2683613736414133,
                    "vector_id": 27217,
                    "tokens_count": 258
                },
                {
                    "score": 0.2662995159626007,
                    "vector_id": 35873,
                    "tokens_count": 126
                },
                {
                    "score": 0.2650427003217549,
                    "vector_id": 35677,
                    "tokens_count": 42
                }
            ],
            "vectors_used": [
                27025,
                37548,
                28960
            ],
            "final_response": [
                "For Gopal Mansion, an air-conditioned room with TV and bath is Rs 800 per night.",
                "We also offer specially subsidized air-conditioned rooms at our clinic for Rs 2000 (US $50) per night, and non-AC rooms for Rs 1500 (US$ 40) per night, including free breakfast.",
                "Happy Home Hotel, which is a 5-minute walk from our clinic, offers single rooms for Rs 1400 and double rooms for Rs 2000.",
                "To discuss your specific needs and coordinate your visit, you can [book a consultation call](https:\/\/pages.razorpay.com\/ivfconsultation) with Dr. Malpani."
            ]
        }
    }
}